app/controllers/orders_controller.rb

  def yuyue
    @orders = Order.all.where("yuyue_at=?", Time.now.wday)
---
SELECT "orders".* FROM "orders" WHERE (yuyue_at=1)

  def create
    params.permit!
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "updated_at", "user_id", "yuyue_at", "yuyue_type") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 03 Mar 2014 13:48:49 UTC +00:00], ["updated_at", Mon, 03 Mar 2014 13:48:49 UTC +00:00], ["user_id", 1], ["yuyue_at", "2"], ["yuyue_type", 2]]

  def update
    params.permit!
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "user_id" = ?, "yuyue_at" = ?, "updated_at" = ? WHERE "orders"."id" = 2  [["user_id", nil], ["yuyue_at", "1"], ["updated_at", Mon, 03 Mar 2014 15:15:05 UTC +00:00]]