app/controllers/users_controller.rb

  def userinfo
    @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def create
    params.permit!
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("account", "created_at", "pwd", "updated_at") VALUES (?, ?, ?, ?)  [["account", "a"], ["created_at", Mon, 03 Mar 2014 11:16:05 UTC +00:00], ["pwd", "a"], ["updated_at", Mon, 03 Mar 2014 11:16:05 UTC +00:00]]

  def update
    params.permit!
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "account" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["account", "410526198912043796"], ["updated_at", Mon, 03 Mar 2014 11:58:50 UTC +00:00]]